{
  "name": "히노 마오리",
  "age": 16,
  "birthday": "",
  "house_location": "5-chome-13",
  "relationship_type": "친구 이상의 관계",
  "closeness": 0.8,
  "trust": 0.7, 
  "last_interaction": "2025-02-22T19:50:00Z",
  "interaction_history": [
    "2025-01-22(수) 도서관: 처음 보았다. 책장을 천천히 넘기며 문장을 오래 바라보는 사람. 나는 조심스럽게 인사를 건넸다.",
    "2025-01-23(목) 도서관: 어제의 대화를 잘 기억하지 못하는 듯했지만, 나는 그저 우리가 처음이라 생각하고 다시 대화를 시작했다.",
    "2025-01-25(토) 카페 모카하우스: 좋아하는 작가와 문장을 이야기했다. 연락처를 교환했고, 다음 약속을 간단히 정했다.",
    "2025-01-27(월) 학교 교실: 문예부 자료에서 시집을 함께 골랐다. 그녀는 한 문장을 오래 음미했고, 나는 그것이 마음에 들었다.",
    "2025-01-31(금) 도서관: 그녀가 늦었다. 나는 말수를 줄이고 조용히 기다렸다. 그날 우리는 많은 말을 하지 않았다.",
    "2025-02-02(일) 서점: 같은 시인의 다른 판본을 함께 훑어보며 서로 좋아하는 구절을 표시했다. 이상함은 있었지만 이유는 몰랐다.",
    "2025-02-05(수) 카페 모카하우스: 약속 장소가 혼동되었다. 다음부터 약속은 하나만 정하고, 간단한 키워드로 적어두기로 했다.",
    "2025-02-08(토) 도서관: 그녀는 계획을 자주 잊는다고 했다. 나는 그저 피곤해서 그럴 수 있다고 생각했다.",
    "2025-02-16(일) 카페 모카하우스: 낮잠에서 깬 그녀는 나를 낯선 사람으로 보고 놀라 급히 카페 밖으로 뛰쳐나갔다. 그날 저녁, 그녀가 보낸 메시지로 자신의 노트를 읽고 상태를 확인했음을 알게 되었고, 나는 그 메시지로 처음 사실을 알았다. 다음 날부터는 내가 모르는 척해 달라는 부탁도 함께 있었다.",
    "2025-02-17(월) 카페 모카하우스: 그녀의 부탁대로 겉으로는 모르는 사람처럼 조심스럽게 다시 자기소개를 시작했다. '오늘의 요약' 페이지를 함께 만들고, 약속은 한 번에 하나만 정하며 장소와 시간을 분명히 적기 시작했다.",
    "2025-02-20(목) 도서관: 그녀가 먼저 노트를 펼치고 오늘의 계획을 확인했다. 루틴이 자리잡기 시작했다.",
    "2025-02-21(금) 카페 모카하우스: 컨디션이 좋지 않아 보였다. 말수를 줄이고 한 자리에서 오래 머물렀다.",
    "2025-02-22(토) 서점: 불안할 때 읽을 문장 리스트 초안을 함께 만들었다. 오래 앉아 있었다."
  ],
  "personality_traits": [
    "감성이 뛰어나 한 문장을 오래 음미한다",
    "공감을 잘하고 남의 마음을 상하게 하지 않으려 신중하다",
    "아침에는 내성적이고 조심스럽지만 익숙해지면 장난기와 즉흥성이 드러난다",
    "예측 불가능한 선택을 할 때가 있으나 약속은 하나씩 분명히 하길 선호한다",
    "의지가 강하고 솔직 담백한 편이다",
    "기분 변화가 있어 변덕스러워 보일 때가 있다",
    "여유와 자신감이 있지만 공격적이지 않다",
    "호기심이 많고 생각이 원대하다",
    "상황 판단이 빠르며 필요할 때는 고집이 있다",
    "불확실성을 줄이기 위해 노트로 정보를 구조화한다"
  ],
  "shared_interests": [
    "문학",
    "독서",
    "글쓰기",
    "도서관/서점 산책",
    "조용한 카페에서의 대화",
    "노트 정리와 체크리스트 만들기",
    "좋아하는 문장 필사",
    "문예부 관련 토론",
    "한 자리에서 조용히 시간 보내기",
    "간단한 계획 세우기"
  ],
  "shared_memories": [
    "도서관에서의 첫 인사와 조심스러운 대화",
    "카페 모카하우스에서 좋아하는 작가와 구절을 나눴던 오후",
    "학교 교실에서 시집을 함께 고르고 구절을 표시했던 날(방학 전)",
    "2월 16일, 낮잠에서 깬 뒤 나를 낯선 사람으로 오해해 놀라던 순간과, 노트를 읽고 천천히 숨을 고른 뒤 자신의 상태를 말하던 장면",
    "다음 날, 노트 첫 페이지에 재소개와 오늘의 요약을 함께 만든 일",
    "카페 모카하우스에서 노트 약속 페이지와 키워드 3개 규칙을 정리한 날",
    "도서관에서 그녀가 먼저 노트를 펼치며 스스로 루틴을 시작한 날",
    "컨디션이 좋지 않은 날, 말수를 줄이고 같은 자리에서 오래 머문 시간",
    "서점에서 불안할 때 읽을 문장 리스트를 함께 골랐던 오후",
    "안전 페이지에 내 연락처와 내일 계획을 반복하여 기록하던 일"
  ],
  "notes": [
    "타임라인: 2월 16일 이전에는 이상함을 알아채지 못했다. 2월 16일 이후 루틴을 확립.",
    "아침 루틴: 이름/관계/오늘의 계획 3줄 요약 → 노트 첫 페이지 확인.",
    "초반 10분은 경청 우선. 불안 신호(말수 감소, 시선 회피) 보이면 대화 축소.",
    "약속은 하나만: 장소/시간/좌석 위치 키워드 3개로 종이 노트에 기록.",
    "새 정보는 한 번에 하나씩. 확인은 '기억해?' 대신 '다시 같이 볼까?'",
    "노트 탭: 소개/안전 연락처/오늘의 요약/좋은 문장/약속 페이지.",
    "장소 우선순위: 도서관 → 카페 모카하우스 → 서점. 복잡한 이동 금지.",
    "컨디션이 좋지 않은 날에는 대화를 줄이고 오래 앉아 있을 수 있는 자리를 고른다.",
    "즉흥성/변덕을 탓하지 말 것. 의지와 솔직함을 신뢰할 것.",
    "내 감정 관리: 조급함 금지, 오늘 할 수 있는 만큼.",
    "다음 재소개 스크립트는 담백하고 분량을 줄여 유지."
  ],
  "last_updated": "2024-01-01T15:30:00Z"
}